import KtaneModule from "./KtaneModule";
import React from "react";
import "../css/WhosOnFirstModule.css";

export default class WhosOnFirstModule extends KtaneModule {
  static getTitle() {
    return "А вас як звуть? Авас (Пи-а-ес)";
  }

  constructor(props) {
    super(props);

    const
      TL = "зліва згори (1)",
      TR = "справа згори (2)",
      ML = "зліва посередині (3)",
      MR = "справа посередині (4)",
      BL = "зліва знизу (5)",
      BR = "справа знизу (6)";

    this.displays = {
      "ТАК": ML,
      "СПОЧАТКУ": TR,
      "ЕКРАН": BR,
      "ДОБРЕ": TR,
      "ДАЛІ": BR,
      "НІЧОГО": ML,
      "\u00a0": BL, // порожній
      "ПУСТО": MR,
      "НІ": BR,
      "ТЕБЕ": ML,
      "ТБ": BR,
      "ПИТИ": MR,
      "БИТИ": MR,
      "РИТИ": BL,
      "СТІЙ": BL,
      "ЧЕКАЙ": BR,
      "ТИ": MR,
      "ВИ": BR,
      "ТВІЙ": MR,
      "ТВОЇХ": MR,
      "ТВОЯ": TL,
      "ОСЬО": BR,
      "ЇХНІЙ": BL,
      "ЇХ": MR,
      "ВОНИ": ML,
      "БАЧ": BR,
      "АЧ": TR,
      "ПАЧ": BR
    };

    this.sequences = {
      "ГОТОВИЙ": "ТАК, ГАРАЗД, ЩО, СЕРЕДНІЙ, ЛІВО, ТИСНИ, ПРАВИЙ, ПУСТО, ГОТОВИЙ, НІ, ПЕРШИЙ, ЕЕХ, НІЧОГО, ЧЕКАЙ",
      "ПЕРШИЙ": "ЛІВО, ГАРАЗД, ТАК, СЕРЕДНІЙ, НІ, ПРАВИЙ, НІЧОГО, ЕЕХ, ЧЕКАЙ, ГОТОВИЙ, ПУСТО, ЩО, ТИСНИ, ПЕРШИЙ",
      "НІ": "ПУСТО, ЕЕХ, ЧЕКАЙ, ПЕРШИЙ, ЩО, ГОТОВИЙ, ПРАВИЙ, ТАК, НІЧОГО, ЛІВО, ТИСНИ, ГАРАЗД, НІ, СЕРЕДНІЙ",
      "ПУСТО:": "ЧЕКАЙ, ПРАВИЙ, ГАРАЗД, СЕРЕДНІЙ, ПУСТО, ТИСНИ, ГОТОВИЙ, НІЧОГО, НІ, ЩО, ЛІВО, ЕЕХ, ТАК, ПЕРШИЙ",
      "НІЧОГО:": "ЕЕХ, ПРАВИЙ, ГАРАЗД, СЕРЕДНІЙ, ТАК, ПУСТО, НІ, ТИСНИ, ЛІВО, ЩО, ЧЕКАЙ, ПЕРШИЙ, НІЧОГО, ГОТОВИЙ",
      "ТАК:": "ГАРАЗД, ПРАВИЙ, ЕЕХ, СЕРЕДНІЙ, ПЕРШИЙ, ЩО, ТИСНИ, ГОТОВИЙ, НІЧОГО, ТАК, ЛІВО, ПУСТО, НІ, ЧЕКАЙ",
      "ЩО:": "ЕЕХ, ЩО, ЛІВО, НІЧОГО, ГОТОВИЙ, ПУСТО, СЕРЕДНІЙ, НІ, ГАРАЗД, ПЕРШИЙ, ЧЕКАЙ, ТАК, ТИСНИ, ПРАВИЙ",
      "ЕЕХ:": "ГОТОВИЙ, НІЧОГО, ЛІВО, ЩО, ГАРАЗД, ТАК, ПРАВИЙ, НІ, ТИСНИ, ПУСТО, ЕЕХ, СЕРЕДНІЙ, ЧЕКАЙ, ПЕРШИЙ",
      "ЛІВО:": "ПРАВИЙ, ЛІВО, ПЕРШИЙ, НІ, СЕРЕДНІЙ, ТАК, ПУСТО, ЩО, ЕЕХ, ЧЕКАЙ, ТИСНИ, ГОТОВИЙ, ГАРАЗД, НІЧОГО",
      "ПРАВИЙ:": "ТАК, НІЧОГО, ГОТОВИЙ, ТИСНИ, НІ, ЧЕКАЙ, ЩО, ПРАВИЙ, СЕРЕДНІЙ, ЛІВО, ЕЕХ, ПУСТО, ГАРАЗД, ПЕРШИЙ",
      "СЕРЕДНІЙ:": "ПУСТО, ГОТОВИЙ, ГАРАЗД, ЩО, НІЧОГО, ТИСНИ, НІ, ЧЕКАЙ, ЛІВО, СЕРЕДНІЙ, ПРАВИЙ, ПЕРШИЙ, ЕЕХ, ТАК",
      "ГАРАЗД:": "СЕРЕДНІЙ, НІ, ПЕРШИЙ, ТАК, ЕЕХ, НІЧОГО, ЧЕКАЙ, ГАРАЗД, ЛІВО, ГОТОВИЙ, ПУСТО, ТИСНИ, ЩО, ПРАВИЙ",
      "ЧЕКАЙ:": "ЕЕХ, НІ, ПУСТО, ГАРАЗД, ТАК, ЛІВО, ПЕРШИЙ, ТИСНИ, ЩО, ЧЕКАЙ, НІЧОГО, ГОТОВИЙ, ПРАВИЙ, СЕРЕДНІЙ",
      "ТИСНИ:": "ПРАВИЙ, СЕРЕДНІЙ, ТАК, ГОТОВИЙ, ТИСНИ, ГАРАЗД, НІЧОГО, ЕЕХ, ПУСТО, ЛІВО, ПЕРШИЙ, ЩО, НІ, ЧЕКАЙ",
      "ТИ:": "ЗВИЧАЙНО, ТИ Є, ТВІЙ, ТВОЄ, НАСТУПНИЙ, А АГА, ВАШ, ЗАЖДИ, ЩО?, ТИ, АГА АГА, ФАЙНО, ГОТОВО, ВИ",
      "ТИ Є:": "ТВІЙ, НАСТУПНИЙ, ФАЙНО, А АГА, ЩО?, ГОТОВО, АГА АГА, ЗАЖДИ, ТИ, ВИ, ТВОЄ, ЗВИЧАЙНО, ВАШ, ТИ Є",
      "ТВІЙ:": "АГА АГА, ТИ Є, А АГА, ТВІЙ, НАСТУПНИЙ, ВАШ, ЗВИЧАЙНО, ВИ, ТВОЄ, ТИ, ЩО?, ЗАЖДИ, ФАЙНО, ГОТОВО",
      "ТВОЄ:": "ТИ, ТВОЄ, ВАШ, НАСТУПНИЙ, АГА АГА, ТИ Є, ВИ, ТВІЙ, ЩО?, А АГА, ЗВИЧАЙНО, ГОТОВО, ФАЙНО, ЗАЖДИ",
      "ВАШ:": "ГОТОВО, ВИ, ВАШ, А АГА, ЩО?, ЗВИЧАЙНО, ТВІЙ, ЗАЖДИ, ТВОЄ, ФАЙНО, НАСТУПНИЙ, АГА АГА, ТИ Є, ТИ",
      "ВИ:": "А АГА, ЗВИЧАЙНО, НАСТУПНИЙ, ЩО?, ТВОЄ, ВАШ, АГА АГА, ГОТОВО, ВИ, ТИ, ФАЙНО, ЗАЖДИ, ТИ Є, ТВІЙ",
      "А АГА:": "А АГА, ТВІЙ, ТИ Є, ТИ, ГОТОВО, ЗАЖДИ, АГА АГА, НАСТУПНИЙ, ЗВИЧАЙНО, ФАЙНО, ТВОЄ, ВАШ, ВИ, ЩО?",
      "АГА АГА:": "ВАШ, ВИ, ТИ Є, ТВОЄ, НАСТУПНИЙ, АГА АГА, ГОТОВО, ТИ, А АГА, ФАЙНО, ТВІЙ, ЗВИЧАЙНО, ЗАЖДИ, ЩО?",
      "ЩО?:": "ТИ, ЗАЖДИ, ТВОЄ, ТВІЙ, ВИ, ГОТОВО, АГА АГА, ФАЙНО, ТИ Є, А АГА, ВАШ, НАСТУПНИЙ, ЩО?, ЗВИЧАЙНО",
      "ГОТОВО:": "ЗВИЧАЙНО, А АГА, НАСТУПНИЙ, ЩО?, ТВІЙ, ВАШ, ТВОЄ, ЗАЖДИ, ФАЙНО, ТИ, ВИ, ТИ Є, АГА АГА, ГОТОВО",
      "НАСТУПНИЙ:": "ЩО?, А АГА, АГА АГА, ТВІЙ, ЗАЖДИ, ЗВИЧАЙНО, НАСТУПНИЙ, ФАЙНО, ГОТОВО, ТИ Є, ВАШ, ТВОЄ, ВИ, ТИ",
      "ЗАЖДИ:": "ТИ Є, ВИ, ГОТОВО, АГА АГА, ТИ, ВАШ, ЗВИЧАЙНО, ЩО?, ТВОЄ, НАСТУПНИЙ, ЗАЖДИ, А АГА, ТВІЙ, ФАЙНО",
      "ЗВИЧАЙНО:": "ТИ Є, ГОТОВО, ФАЙНО, ТВОЄ, ТИ, ЗАЖДИ, А АГА, ВАШ, ЗВИЧАЙНО, ВИ, ЩО?, НАСТУПНИЙ, ТВІЙ, АГА АГА",
      "ФАЙНО:": "ТВОЄ, НАСТУПНИЙ, ВИ, ВАШ, ЗАЖДИ, ГОТОВО, АГА АГА, ЩО?, А АГА, ТИ, ФАЙНО, ЗВИЧАЙНО, ТИ Є, ТВІЙ"
    };

    this.setSubstring = this.setSubstring.bind(this);
  }

  getInitialState() {
    return {
      substring: ""
    };
  }

  mainRender() {
    return (
      <>
        <div>
          <input
            aria-label={`${this.constructor.getTitle()} query`}
            onChange={this.setSubstring}
            type="text"
            value={this.state.substring}
          />
        </div>

        <dl>
          {
            Object.entries(this.displays).map(([display, position]) => {
              return <React.Fragment key={display}>
                <dt className={!this.state.substring || display.startsWith(this.state.substring) ? '' : 'inactive'}>
                  {display}
                </dt>
                <dd>{position}</dd>
              </React.Fragment>;
            })
          }
        </dl>

        <table>
          <tbody>
          {
            Object.entries(this.sequences).map(([button, sequence]) => {
              return <React.Fragment key={button}>
                <tr className={!this.state.substring || button.startsWith(this.state.substring) ? '' : 'inactive'}>
                  <th>"{button}":</th>
                  <td>{sequence}</td>
                </tr>
              </React.Fragment>;
            })
          }
          </tbody>
        </table>
      </>
    )
  }

  setSubstring(event) {
    this.setState({substring: event.currentTarget.value.toUpperCase()});
  }
}
